Content:
Used Cars Prices

Here you find 78612 records about used cars:
<br>
60 Brand, 382 Model, 33 Modelyear,
<br>
1839 CarModel, 1397 AveragePrice,
<br>
893 MinimumPrice, 916 MaximumPrice,
<br>
over 128 Months/Year.

### Some Questions you should ask yourself about.
1.  Is there any duplicates? .
2. What about the nulls?.
3. Does all columns has the a correct format in its values? if its not how should you make it better?
4. Datatypes?
5. Before starting , after seeing some info about the dataset and from the first look on the dataset , what columns you think will not be necessary in our dataset? (io: what columns you think dropping it will be better?).
<br>
<br>
feel free to wirte only their names in the next cell

Double Click here to start writing

In [46]:
#import Libraries (numpy & Pandas)
import pandas as pd
import numpy as np

In [60]:
#read Data
data=pd.read_csv("used_car_prices.csv")

In [61]:
#print the first 8 row
data.head(8)

,web-scraper-order,Car Model,Month/Year,Average price,Minimum price,Maximum price
0,1680204632-1,Skoda Octavia A8 2022,2023-03,"967,000 EGP","926,000 EGP","1,017,000 EGP"
1,1680204632-2,Skoda Octavia A8 2022,2023-02,"979,000 EGP","931,000 EGP","1,045,000 EGP"
2,1680204632-3,Skoda Octavia A8 2022,2023-01,"917,000 EGP","893,000 EGP","950,000 EGP"
3,1680204632-4,Skoda Octavia A8 2022,2022-12,"881,000 EGP","793,000 EGP","950,000 EGP"
4,1680204632-5,Skoda Octavia A8 2022,2022-11,"868,000 EGP","789,000 EGP","950,000 EGP"
5,1680204632-6,Skoda Octavia A8 2022,2022-10,"797,000 EGP","789,000 EGP","808,000 EGP"
6,1680204632-7,Skoda Octavia A8 2022,2022-09,"837,000 EGP","770,000 EGP","874,000 EGP"
7,1680204632-8,Skoda Octavia A8 2022,2022-08,"779,000 EGP","722,000 EGP","855,000 EGP"

In [49]:
#print the shape Like (There are 84548 rows and 22 columns)
print(f"there are {data.shape[0]} rows and there are {data.shape[1]} columns")

there are 79090 rows and there are 6 columns

In [50]:
# try seeing some information about the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79090 entries, 0 to 79089
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   web-scraper-order  79090 non-null  object
 1   Car Model          79090 non-null  object
 2   Month/Year         78612 non-null  object
 3   Average price      78612 non-null  object
 4   Minimum price      78612 non-null  object
 5   Maximum price      78612 non-null  object
dtypes: object(6)
memory usage: 3.6+ MB

In [51]:
# show the number of duplicates here
data.duplicated().sum()

0

In [52]:
# show number of nulls
data.isna().sum()

web-scraper-order      0
Car Model              0
Month/Year           478
Average price        478
Minimum price        478
Maximum price        478
dtype: int64

In [53]:
# updated the column names Like(To Start with Upper Litter)
capital=lambda x:x.title()
data=data.rename(columns=capital)

In [54]:
# Split Car Full Data into Brand, Model, And Year of The Model
data[['Brand','Model','Year']]=data['Car Model'].str.split(expand=True,n=2)
data = data.drop(columns=['Car Model'])

In [55]:
# Convert Average price, Minimum price, Maximum price to Numaarical Values
columns_to_convert = ['Average price', 'Minimum price', 'Maximum price']
for column in columns_to_convert:
    if column in data.columns:
        data[column] = pd.to_numeric(data[column].str.replace('EGP', ''))

In [56]:
# Split Month/Year Column to Year and Month
data[['Year', 'Month']] = data['Month/Year'].str.split('-', expand=True)
data = data.drop(columns=['Month/Year'])

In [57]:
# let's start with (Average price ,Minimum price ,Maximum price ) , see the number of nulls in them , replace these nulls with the ( mean , median and mode) of these columns
#and in the end check that there are not nulls in data
data.isna().sum()

Web-Scraper-Order      0
Average Price        478
Minimum Price        478
Maximum Price        478
Brand                  0
Model                  0
Year                 478
Month                478
dtype: int64

In [62]:
data['Average price']=data['Average price'].fillna(data['Average price'].mode()[0])
data["Minimum price"]=data["Minimum price"].fillna(data["Minimum price"].mode()[0])
data["Maximum price"]=data["Maximum price"].fillna(data["Maximum price"].mode()[0])

In [63]:
data['Average price'].isna().sum()

0

In [64]:
data['Minimum price'].isna().sum()

0

In [65]:
data['Maximum price'].isna().sum()

0